system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  12                                    |
|   \\  /    A nd           | Website:  www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// This dictionary controls the creation of patches for the ballast, sleepers, and rail

pointSync false;

patches
(
    {
        // Ballast patch
        name ballast;
        patchInfo
        {
            type wall;
        }
        constructFrom set;
        set ballastCells;
    }
    
    {
        // Sleepers patch
        name sleepers;
        patchInfo
        {
            type wall;
        }
        constructFrom set;
        set sleeperCells;
    }
    
    {
        // Rail patch
        name rail;
        patchInfo
        {
            type wall;
        }
        constructFrom set;
        set railCells;
    }
);

// ************************************************************************* //
