constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          50;
        startFace       19750;
    }
    outlet
    {
        type            patch;
        nFaces          50;
        startFace       19800;
    }
    atmosphere
    {
        type            patch;
        nFaces          200;
        startFace       19850;
    }
    ground
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       20050;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          20000;
        startFace       20250;
    }
)

// ************************************************************************* //
